jason-allen-oneal/ESP32-S3-Watch-OS/components/nightglass_services/src/audio.cpp
#include "nightglass/services/audio.hpp"

#include <algorithm>
#include <array>
#include <atomic>
#include <cmath>
#include <cstdint>
#include <cstring>
#include <limits>

#if defined(CONFIG_NIGHTGLASS_AUDIO_ENABLED) && CONFIG_NIGHTGLASS_AUDIO_ENABLED
#include "audio_codec_ctrl_if.h"
#include "audio_codec_data_if.h"
#include "audio_codec_if.h"
#include "bsp/esp32_s3_touch_amoled_2_06.h"
#include "driver/gpio.h"
#include "driver/i2s_std.h"
#include "es7210_adc.h"
#include "es8311_codec.h"
#include "esp_codec_dev.h"
#include "esp_codec_dev_defaults.h"
#include "esp_heap_caps.h"
#include "esp_log.h"
#include "esp_pm.h"
#include "esp_timer.h"
#include "freertos/FreeRTOS.h"
#include "freertos/idf_additions.h"
#include "freertos/queue.h"
#include "freertos/semphr.h"
#include "freertos/task.h"
#include "nightglass/core/health.hpp"
#include "nightglass/services/power.hpp"
#include "nightglass/services/voice_codec.hpp"
#include "nvs.h"
#define NIGHTGLASS_AUDIO_RUNTIME 1
#else
#define NIGHTGLASS_AUDIO_RUNTIME 0
#endif

#if NIGHTGLASS_AUDIO_RUNTIME
#if defined(NIGHTGLASS_SOUND_NOTIFICATION_EMBEDDED)
extern "C" const std::uint8_t ng_notification_start[] asm("_binary_notification_wav_start");
extern "C" const std::uint8_t ng_notification_end[] asm("_binary_notification_wav_end");
#endif
#if defined(NIGHTGLASS_SOUND_CALL_EMBEDDED)
extern "C" const std::uint8_t ng_call_start[] asm("_binary_call_wav_start");
extern "C" const std::uint8_t ng_call_end[] asm("_binary_call_wav_end");
#endif
#if defined(NIGHTGLASS_SOUND_CALENDAR_EMBEDDED)
extern "C" const std::uint8_t ng_calendar_start[] asm("_binary_calendar_wav_start");
extern "C" const std::uint8_t ng_calendar_end[] asm("_binary_calendar_wav_end");
#endif
#if defined(NIGHTGLASS_SOUND_EMAIL_EMBEDDED)
extern "C" const std::uint8_t ng_email_start[] asm("_binary_email_wav_start");
extern "C" const std::uint8_t ng_email_end[] asm("_binary_email_wav_end");
#endif
#if defined(NIGHTGLASS_SOUND_ALARM_EMBEDDED)
extern "C" const std::uint8_t ng_alarm_start[] asm("_binary_alarm_wav_start");
extern "C" const std::uint8_t ng_alarm_end[] asm("_binary_alarm_wav_end");
#endif
#if defined(NIGHTGLASS_SOUND_TIMER_EMBEDDED)
extern "C" const std::uint8_t ng_timer_start[] asm("_binary_timer_wav_start");
extern "C" const std::uint8_t ng_timer_end[] asm("_binary_timer_wav_end");
#endif
#if defined(NIGHTGLASS_SOUND_SUCCESS_EMBEDDED)
extern "C" const std::uint8_t ng_success_start[] asm("_binary_success_wav_start");
extern "C" const std::uint8_t ng_success_end[] asm("_binary_success_wav_end");
#endif
#if defined(NIGHTGLASS_SOUND_WARNING_EMBEDDED)
extern "C" const std::uint8_t ng_warning_start[] asm("_binary_warning_wav_start");
extern "C" const std::uint8_t ng_warning_end[] asm("_binary_warning_wav_end");
#endif
#endif

namespace nightglass::services {

namespace {
std::uint16_t read_le16(const std::uint8_t *data) {
    return static_cast<std::uint16_t>(data[0]) |
           (static_cast<std::uint16_t>(data[1]) << 8U);
}

std::uint32_t read_le32(const std::uint8_t *data) {
    return static_cast<std::uint32_t>(data[0]) |
           (static_cast<std::uint32_t>(data[1]) << 8U) |
           (static_cast<std::uint32_t>(data[2]) << 16U) |
           (static_cast<std::uint32_t>(data[3]) << 24U);
}
}  // namespace

Pcm16WavView parse_pcm16_mono_wav(std::span<const std::uint8_t> sound) noexcept {
    constexpr std::size_t kMaxPcmBytes = 160000;
    constexpr std::uint32_t kExpectedByteRate = kAudioSampleRateHz * sizeof(std::int16_t);
    if (sound.size() < 44 || std::memcmp(sound.data(), "RIFF", 4) != 0 ||
        std::memcmp(sound.data() + 8, "WAVE", 4) != 0 ||
        sound.size() - 8 > std::numeric_limits<std::uint32_t>::max() ||
        read_le32(sound.data() + 4) != sound.size() - 8) {
        return {};
    }

    bool format_seen = false;
    bool format_valid = false;
    bool data_seen = false;
    Pcm16WavView pcm{};
    std::size_t offset = 12;
    while (offset + 8 <= sound.size()) {
        const auto *chunk = sound.data() + offset;
        const auto chunk_size = static_cast<std::size_t>(read_le32(chunk + 4));
        const auto data_offset = offset + 8;
        if (chunk_size > sound.size() - data_offset) return {};
        if (std::memcmp(chunk, "fmt ", 4) == 0) {
            if (format_seen || chunk_size < 16) return {};
            format_seen = true;
            format_valid = read_le16(sound.data() + data_offset) == 1 &&
                           read_le16(sound.data() + data_offset + 2) == 1 &&
                           read_le32(sound.data() + data_offset + 4) == kAudioSampleRateHz &&
                           read_le32(sound.data() + data_offset + 8) == kExpectedByteRate &&
                           read_le16(sound.data() + data_offset + 12) == sizeof(std::int16_t) &&
                           read_le16(sound.data() + data_offset + 14) == 16;
        } else if (std::memcmp(chunk, "data", 4) == 0) {
            if (data_seen) return {};
            data_seen = true;
            pcm = {data_offset, chunk_size, false};
        }
        const auto padded_size = chunk_size + (chunk_size & 1U);
        if (padded_size > sound.size() - data_offset) return {};
        offset = data_offset + padded_size;
    }
    pcm.valid = format_seen && format_valid && data_seen && pcm.data_size > 0 &&
                pcm.data_size <= kMaxPcmBytes &&
                pcm.data_size % sizeof(std::int16_t) == 0;
    return pcm.valid ? pcm : Pcm16WavView{};
}

namespace {

constexpr std::size_t kMaxIoBytes = 4096;

#if NIGHTGLASS_AUDIO_RUNTIME
constexpr char kTag[] = "nightglass_audio";
constexpr char kAudioNvsNamespace[] = "ng_audio";
constexpr std::uint32_t kSampleRateHz = kAudioSampleRateHz;
// Waveshare's maintained board path is mono: one physical speaker and the
// first populated ES7210 capture lane. Keep the transport aligned with that
// proven geometry instead of forcing a stereo slot the board does not use.
constexpr std::uint8_t kChannels = 1;
constexpr std::size_t kFrameBytes = kChannels * sizeof(std::int16_t);
// Stream the audible diagnostic through a small 64 ms PSRAM chunk so its
// temporary allocation coexists with the AMOLED and BLE DMA requirements.
constexpr std::size_t kDiagnosticBytes = 2048;
constexpr std::size_t kDiagnosticFrames = kDiagnosticBytes / kFrameBytes;
constexpr std::uint32_t kIoTimeoutMs = 150;
constexpr std::uint32_t kPlaybackDrainMs = 72;
constexpr std::uint32_t kMicrophoneSettleMs = 50;
constexpr std::uint32_t kAudioTaskStackBytes = 4096;
// Keep two physical queue slots unavailable to ordinary notification/UI cues
// so an alarm and countdown can both be admitted even during a burst. The
// currently playing command is counted separately in pending_count, making
// this reservation conservative while hardware is active.
constexpr UBaseType_t kAudioQueueDepth = 6;
constexpr std::uint8_t kCriticalCueReserve = 2;
constexpr std::int16_t kToneAmplitude = 12000;
// The esp_codec_dev wrapper's volume setter discards the codec driver's I2C
// result. Use the codec interface directly so PA enable is gated on a real
// gain-register write, not merely on the wrapper accepting the request.
constexpr float kMicrophoneGainDb = 30.0F;
constexpr gpio_num_t kAmplifierGpio = BSP_POWER_AMP_IO;

