jason-allen-oneal/ESP32-S3-Watch-OS/components/nightglass_services/src/audio.cpp
struct AudioResources {
    i2s_chan_handle_t channel{nullptr};
    const audio_codec_data_if_t *data_if{nullptr};
    const audio_codec_ctrl_if_t *ctrl_if{nullptr};
    const audio_codec_if_t *codec_if{nullptr};
    esp_codec_dev_handle_t device{nullptr};
    esp_codec_dev_type_t device_type{ESP_CODEC_DEV_TYPE_NONE};
    bool device_open{false};
};

struct CleanupResult {
    bool amplifier_disabled{false};
    bool resources_released{true};
};

struct OperationResult {
    nightglass::core::Status status{nightglass::core::Status::Ok()};
    std::size_t transferred_bytes{0};
    std::size_t expected_bytes{kDiagnosticBytes};
    std::uint32_t capture_rms{0};
    std::size_t encoded_bytes{0};
    bool cancelled{false};
    bool amplifier_disabled{true};
    bool resources_released{true};
};

struct AudioCommand {
    AudioOperation operation{AudioOperation::none};
    SoundCue cue{SoundCue::test};
    std::uint32_t generation{0};
    std::size_t voice_capacity{0};
    VoiceCaptureSink voice_sink{nullptr};
    VoiceCaptureCallback voice_callback{nullptr};
    void *voice_context{nullptr};
};

AudioService instance;
AudioSnapshot state{};
i2c_master_bus_handle_t audio_bus{nullptr};
portMUX_TYPE state_mux = portMUX_INITIALIZER_UNLOCKED;
StaticQueue_t audio_queue_state{};
std::array<std::uint8_t, kAudioQueueDepth * sizeof(AudioCommand)> audio_queue_storage{};
QueueHandle_t audio_queue{nullptr};
TaskHandle_t audio_worker{nullptr};
StaticSemaphore_t request_mutex_state{};
SemaphoreHandle_t request_mutex{nullptr};
std::uint16_t pending_cues{};
std::uint8_t pending_count{};
bool capture_pending{};
std::atomic_bool voice_stop_requested{false};
std::atomic_bool voice_cancel_requested{false};
std::uint32_t alarm_generation{1};
std::uint32_t timer_generation{1};

std::uint32_t cue_generation_locked(SoundCue cue) {
    if (cue == SoundCue::alarm) return alarm_generation;
    if (cue == SoundCue::timer) return timer_generation;
    return 0;
}

bool cue_cancelled(SoundCue cue, std::uint32_t generation) {
    if (generation == 0) return false;
    portENTER_CRITICAL(&state_mux);
    const bool cancelled = generation != cue_generation_locked(cue);
    portEXIT_CRITICAL(&state_mux);
    return cancelled;
}

AudioSettings load_audio_settings() {
    AudioSettings settings{};
    nvs_handle_t handle{};
    if (nvs_open(kAudioNvsNamespace, NVS_READONLY, &handle) != ESP_OK) return settings;
    std::uint8_t value{};
    if (nvs_get_u8(handle, "volume", &value) == ESP_OK) settings.volume_percent = value;
    if (nvs_get_u8(handle, "muted", &value) == ESP_OK) settings.muted = value != 0;
    if (nvs_get_u8(handle, "dnd", &value) == ESP_OK) settings.do_not_disturb = value != 0;
    nvs_close(handle);
    return valid_audio_settings(settings) ? settings : AudioSettings{};
}

esp_err_t save_audio_settings(const AudioSettings &settings) {
    nvs_handle_t handle{};
    auto result = nvs_open(kAudioNvsNamespace, NVS_READWRITE, &handle);
    if (result != ESP_OK) return result;
    if ((result = nvs_set_u8(handle, "volume", settings.volume_percent)) == ESP_OK &&
        (result = nvs_set_u8(handle, "muted", settings.muted ? 1 : 0)) == ESP_OK &&
        (result = nvs_set_u8(handle, "dnd", settings.do_not_disturb ? 1 : 0)) == ESP_OK) {
        result = nvs_commit(handle);
    }
    nvs_close(handle);
    return result;
}

float output_gain_db(std::uint8_t volume_percent) {
    // Map the full UI range into a conservative codec range whose maximum is
    // the already-proven -8 dB operating point.
    return -40.0F + static_cast<float>(volume_percent) * 0.32F;
}

struct EmbeddedSoundView {
    const std::uint8_t *data{nullptr};
    std::size_t size{0};
};

struct PcmSoundView {
    const std::uint8_t *data{nullptr};
    std::size_t size{0};
};

EmbeddedSoundView embedded_sound(SoundCue cue) {
    switch (cue) {
#if defined(NIGHTGLASS_SOUND_NOTIFICATION_EMBEDDED)
        case SoundCue::notification:
            return {ng_notification_start,
                    static_cast<std::size_t>(ng_notification_end - ng_notification_start)};
#endif
#if defined(NIGHTGLASS_SOUND_CALL_EMBEDDED)
        case SoundCue::call:
            return {ng_call_start, static_cast<std::size_t>(ng_call_end - ng_call_start)};
#endif
#if defined(NIGHTGLASS_SOUND_CALENDAR_EMBEDDED)
        case SoundCue::calendar:
            return {ng_calendar_start,
                    static_cast<std::size_t>(ng_calendar_end - ng_calendar_start)};
#endif
#if defined(NIGHTGLASS_SOUND_EMAIL_EMBEDDED)
        case SoundCue::email:
            return {ng_email_start, static_cast<std::size_t>(ng_email_end - ng_email_start)};
#endif
#if defined(NIGHTGLASS_SOUND_ALARM_EMBEDDED)
        case SoundCue::alarm:
            return {ng_alarm_start, static_cast<std::size_t>(ng_alarm_end - ng_alarm_start)};
#endif
#if defined(NIGHTGLASS_SOUND_TIMER_EMBEDDED)
        case SoundCue::timer:
            return {ng_timer_start, static_cast<std::size_t>(ng_timer_end - ng_timer_start)};
#endif
#if defined(NIGHTGLASS_SOUND_SUCCESS_EMBEDDED)
        case SoundCue::success:
            return {ng_success_start,
                    static_cast<std::size_t>(ng_success_end - ng_success_start)};
#endif
#if defined(NIGHTGLASS_SOUND_WARNING_EMBEDDED)
        case SoundCue::warning:
            return {ng_warning_start,
                    static_cast<std::size_t>(ng_warning_end - ng_warning_start)};
#endif
        default: return {};
    }
}

PcmSoundView parse_embedded_wav(EmbeddedSoundView sound) {
    if (sound.data == nullptr) return {};
    const auto parsed = parse_pcm16_mono_wav({sound.data, sound.size});
    return parsed.valid
               ? PcmSoundView{sound.data + parsed.data_offset, parsed.data_size}
               : PcmSoundView{};
}

bool set_amplifier(bool enabled) {
    if (gpio_set_direction(kAmplifierGpio, GPIO_MODE_INPUT_OUTPUT) != ESP_OK ||
        gpio_set_level(kAmplifierGpio, enabled ? 1 : 0) != ESP_OK) {
        return false;
    }
    return gpio_get_level(kAmplifierGpio) == (enabled ? 1 : 0);
}

bool force_amplifier_off() { return set_amplifier(false); }

void mark_operation_active(AudioOperation operation, SoundCue cue, bool input, bool output,
                           bool amplifier_disabled, std::uint8_t volume_percent) {
    portENTER_CRITICAL(&state_mux);
    state.hardware_initialized = true;
    state.hardware_active = true;
    state.input_ready = input;
    state.output_ready = output;
    state.operation = operation;
    state.cue = cue;
    state.output_volume = output ? volume_percent : 0;
    state.amplifier_disabled = amplifier_disabled;
    state.amplifier_disabled_verified = amplifier_disabled;
    ++state.sequence;
    portEXIT_CRITICAL(&state_mux);
}

bool create_i2s(AudioResources &resources, bool playback) {
    i2s_chan_config_t channel_config = I2S_CHANNEL_DEFAULT_CONFIG(
        static_cast<i2s_port_t>(CONFIG_BSP_I2S_NUM), I2S_ROLE_MASTER);
    // Two short DMA descriptors keep the one-shot diagnostic from competing
    // with the display's contiguous internal DMA requirement.
    channel_config.dma_desc_num = 2;
    channel_config.dma_frame_num = 128;
    channel_config.auto_clear = true;

    const esp_err_t channel_status = playback
                                         ? i2s_new_channel(&channel_config, &resources.channel, nullptr)
                                         : i2s_new_channel(&channel_config, nullptr, &resources.channel);
    if (channel_status != ESP_OK) return false;

    const i2s_std_config_t standard_config = {
        .clk_cfg = I2S_STD_CLK_DEFAULT_CONFIG(kSampleRateHz),
        .slot_cfg = I2S_STD_PHILIPS_SLOT_DEFAULT_CONFIG(I2S_DATA_BIT_WIDTH_16BIT,
                                                         I2S_SLOT_MODE_MONO),
        .gpio_cfg = {
            .mclk = BSP_I2S_MCLK,
            .bclk = BSP_I2S_SCLK,
            .ws = BSP_I2S_LCLK,
            .dout = playback ? BSP_I2S_DOUT : I2S_GPIO_UNUSED,
            .din = playback ? I2S_GPIO_UNUSED : BSP_I2S_DSIN,
            .invert_flags = {.mclk_inv = false, .bclk_inv = false, .ws_inv = false},
        },
    };
    if (i2s_channel_init_std_mode(resources.channel, &standard_config) != ESP_OK) return false;

