jason-allen-oneal/ESP32-S3-Watch-OS/components/nightglass_services/src/audio.cpp
    audio_codec_i2s_cfg_t data_config = {
        .port = CONFIG_BSP_I2S_NUM,
        .rx_handle = playback ? nullptr : resources.channel,
        .tx_handle = playback ? resources.channel : nullptr,
        .clk_src = 0,
    };
    resources.data_if = audio_codec_new_i2s_data(&data_config);
    return resources.data_if != nullptr;
}

bool open_output(AudioResources &resources, std::uint8_t volume_percent) {
    if (!create_i2s(resources, true)) return false;

    audio_codec_i2c_cfg_t i2c_config = {
        .port = BSP_I2C_NUM,
        .addr = ES8311_CODEC_DEFAULT_ADDR,
        .bus_handle = audio_bus,
    };
    resources.ctrl_if = audio_codec_new_i2c_ctrl(&i2c_config);
    if (resources.ctrl_if == nullptr) return false;

    // GPIO46 is intentionally *not* handed to the codec. ES8311 may unmute
    // itself while opening, but the Nightglass-owned physical PA gate remains
    // low until the bounded I2S write is about to begin.
    es8311_codec_cfg_t codec_config = {
        .ctrl_if = resources.ctrl_if,
        .gpio_if = nullptr,
        .codec_mode = ESP_CODEC_DEV_WORK_MODE_DAC,
        .pa_pin = GPIO_NUM_NC,
        .pa_reverted = false,
        .master_mode = false,
        .use_mclk = true,
        .digital_mic = false,
        .invert_mclk = false,
        .invert_sclk = false,
        .hw_gain = {.pa_voltage = 5.0, .codec_dac_voltage = 3.3, .pa_gain = 0.0},
        .no_dac_ref = false,
        .mclk_div = 256,
    };
    resources.codec_if = es8311_codec_new(&codec_config);
    if (resources.codec_if == nullptr) return false;

    esp_codec_dev_cfg_t device_config = {
        .dev_type = ESP_CODEC_DEV_TYPE_OUT,
        .codec_if = resources.codec_if,
        .data_if = resources.data_if,
    };
    resources.device_type = ESP_CODEC_DEV_TYPE_OUT;
    resources.device = esp_codec_dev_new(&device_config);
    if (resources.device == nullptr) return false;

    esp_codec_dev_sample_info_t sample = {
        .bits_per_sample = I2S_DATA_BIT_WIDTH_16BIT,
        .channel = kChannels,
        .channel_mask = 0x01,
        .sample_rate = kSampleRateHz,
        .mclk_multiple = 256,
    };
    if (esp_codec_dev_open(resources.device, &sample) != ESP_CODEC_DEV_OK) return false;
    resources.device_open = true;
    // esp_codec_dev_set_out_vol() returns success even when the codec driver's
    // I2C write fails. Set the conservative test gain through the underlying
    // interface and require its return value before the physical PA gate can
    // be raised.
    if (resources.codec_if->set_vol == nullptr ||
        resources.codec_if->set_vol(resources.codec_if, output_gain_db(volume_percent)) !=
            ESP_CODEC_DEV_OK) {
        return false;
    }
    return true;
}

bool open_input(AudioResources &resources) {
    if (!create_i2s(resources, false)) return false;

    audio_codec_i2c_cfg_t i2c_config = {
        .port = BSP_I2C_NUM,
        .addr = ES7210_CODEC_DEFAULT_ADDR,
        .bus_handle = audio_bus,
    };
    resources.ctrl_if = audio_codec_new_i2c_ctrl(&i2c_config);
    if (resources.ctrl_if == nullptr) return false;

    es7210_codec_cfg_t codec_config = {
        .ctrl_if = resources.ctrl_if,
        .master_mode = false,
        .mic_selected = static_cast<std::uint8_t>(ES7210_SEL_MIC1 | ES7210_SEL_MIC2),
        .mclk_src = ES7210_MCLK_FROM_PAD,
        .mclk_div = 256,
    };
    resources.codec_if = es7210_codec_new(&codec_config);
    if (resources.codec_if == nullptr) return false;

    esp_codec_dev_cfg_t device_config = {
        .dev_type = ESP_CODEC_DEV_TYPE_IN,
        .codec_if = resources.codec_if,
        .data_if = resources.data_if,
    };
    resources.device_type = ESP_CODEC_DEV_TYPE_IN;
    resources.device = esp_codec_dev_new(&device_config);
    if (resources.device == nullptr) return false;

    esp_codec_dev_sample_info_t sample = {
        .bits_per_sample = I2S_DATA_BIT_WIDTH_16BIT,
        .channel = kChannels,
        .channel_mask = 0x01,
        .sample_rate = kSampleRateHz,
        .mclk_multiple = 256,
    };
    if (esp_codec_dev_open(resources.device, &sample) != ESP_CODEC_DEV_OK) return false;
    resources.device_open = true;
    // esp_codec_dev_open() reapplies its zero-initialized cached gain after
    // the ES7210 driver selects a sane 30 dB default. Restore the diagnostic
    // gain through the underlying interface and require the I2C result.
    if (resources.codec_if->set_mic_gain == nullptr ||
        resources.codec_if->set_mic_gain(resources.codec_if, kMicrophoneGainDb) !=
            ESP_CODEC_DEV_OK) {
        return false;
    }
    return true;
}

CleanupResult release_resources(AudioResources &resources) {
    CleanupResult result{};
    // The PA is the actual safety boundary. Assert it before every best-effort
    // codec close, then assert/read it again after cleanup.
    result.amplifier_disabled = force_amplifier_off();

    // esp_codec_dev_close() intentionally discards the codec/data driver's
    // disable result. Invoke the codec interface directly first so an I2C
    // suspend failure cannot be reported as a clean diagnostic shutdown.
    if (resources.codec_if != nullptr) {
        bool codec_shutdown_ok = true;
        if (resources.device_open) {
            const int shutdown_status = resources.codec_if->enable != nullptr
                                            ? resources.codec_if->enable(resources.codec_if, false)
                                            : ESP_CODEC_DEV_NOT_SUPPORT;
            codec_shutdown_ok = shutdown_status == ESP_CODEC_DEV_OK;
            if (!codec_shutdown_ok) {
                ESP_LOGE(kTag, "codec shutdown failed: %d", shutdown_status);
            }
        }
        if (!codec_shutdown_ok) result.resources_released = false;
    }
    if (resources.device != nullptr) {
        if (resources.device_open) {
            // This close updates the wrapper's state and requests I2S stop.
            // The explicit channel disable below proves the final driver
            // state because the wrapper discards its data-interface result.
            if (esp_codec_dev_close(resources.device) != ESP_CODEC_DEV_OK) {
                ESP_LOGE(kTag, "codec wrapper close failed");
                result.resources_released = false;
            }
            resources.device_open = false;
        }
        esp_codec_dev_delete(resources.device);
        resources.device = nullptr;
    }
    if (resources.codec_if != nullptr) {
        const int delete_status = audio_codec_delete_codec_if(resources.codec_if);
        if (delete_status != ESP_CODEC_DEV_OK) {
            ESP_LOGE(kTag, "codec interface delete failed: %d", delete_status);
            result.resources_released = false;
        }
        resources.codec_if = nullptr;
    }
    if (resources.ctrl_if != nullptr) {
        const int delete_status = audio_codec_delete_ctrl_if(resources.ctrl_if);
        if (delete_status != ESP_CODEC_DEV_OK) {
            ESP_LOGE(kTag, "codec control delete failed: %d", delete_status);
            result.resources_released = false;
        }
        resources.ctrl_if = nullptr;
    }
    if (resources.data_if != nullptr) {
        const int delete_status = audio_codec_delete_data_if(resources.data_if);
        if (delete_status != ESP_CODEC_DEV_OK) {
            ESP_LOGE(kTag, "codec data delete failed: %d", delete_status);
            result.resources_released = false;
        }
        resources.data_if = nullptr;
    }
    if (resources.channel != nullptr) {
        const auto disable_status = i2s_channel_disable(resources.channel);
        if (disable_status != ESP_OK && disable_status != ESP_ERR_INVALID_STATE) {
            ESP_LOGE(kTag, "I2S disable failed: %s", esp_err_to_name(disable_status));
            result.resources_released = false;
        }
        const auto delete_status = i2s_del_channel(resources.channel);
        if (delete_status != ESP_OK) {
            ESP_LOGE(kTag, "I2S channel delete failed: %s", esp_err_to_name(delete_status));
            result.resources_released = false;
        }
        resources.channel = nullptr;
    }
    result.amplifier_disabled = force_amplifier_off() && result.amplifier_disabled;
    return result;
}

bool acquire_audio_power_lock(esp_pm_lock_handle_t &lock) {
    if (esp_pm_lock_create(ESP_PM_NO_LIGHT_SLEEP, 0, "ng_audio", &lock) != ESP_OK) return false;
    if (esp_pm_lock_acquire(lock) == ESP_OK) return true;
    (void)esp_pm_lock_delete(lock);
    lock = nullptr;
    return false;
}

