jason-allen-oneal/ESP32-S3-Watch-OS/components/nightglass_services/src/audio.cpp
bool release_audio_power_lock(esp_pm_lock_handle_t lock) {
    if (lock == nullptr) return true;
    const bool released = esp_pm_lock_release(lock) == ESP_OK;
    const bool deleted = esp_pm_lock_delete(lock) == ESP_OK;
    return released && deleted;
}

long double cue_frequency(SoundCue cue, std::uint32_t elapsed_ms) {
    switch (cue) {
        case SoundCue::notification:
            if (elapsed_ms < 160) return 880.0L;
            if (elapsed_ms < 220) return 0.0L;
            return 1320.0L;
        case SoundCue::call:
            return elapsed_ms % 250U < 200U
                       ? ((elapsed_ms / 250U) % 2U ? 988.0L : 740.0L)
                       : 0.0L;
        case SoundCue::calendar:
            if (elapsed_ms < 250) return 784.0L;
            if (elapsed_ms < 330) return 0.0L;
            return 1175.0L;
        case SoundCue::email:
            if (elapsed_ms < 200) return 660.0L;
            if (elapsed_ms < 260) return 0.0L;
            return 880.0L;
        case SoundCue::alarm:
            return (elapsed_ms / 250U) % 2U ? 660.0L : 880.0L;
        case SoundCue::timer:
            return elapsed_ms % 300U < 160U ? 1200.0L : 0.0L;
        case SoundCue::success:
            return elapsed_ms < 250U ? 880.0L : 1320.0L;
        case SoundCue::warning:
            return elapsed_ms % 400U < 250U ? 440.0L : 0.0L;
        case SoundCue::test:
            return 880.0L;
    }
    return 880.0L;
}

void generate_sound_cue(std::int16_t *samples, SoundCue cue,
                        std::size_t initial_frame, std::size_t frame_count) {
    constexpr long double kPi = 3.1415926535897932384626433832795L;
    for (std::size_t frame = 0; frame < frame_count; ++frame) {
        const auto absolute_frame = initial_frame + frame;
        const auto elapsed_ms = static_cast<std::uint32_t>(
            absolute_frame * 1000U / kSampleRateHz);
        const auto frequency_hz = cue_frequency(cue, elapsed_ms);
        const auto phase = (2.0L * kPi * frequency_hz *
                            static_cast<long double>(absolute_frame)) /
                           static_cast<long double>(kSampleRateHz);
        const auto value = frequency_hz == 0.0L
                               ? std::int16_t{0}
                               : static_cast<std::int16_t>(
                                     std::sin(phase) * static_cast<long double>(kToneAmplitude));
        samples[frame * kChannels] = value;
    }
}

OperationResult run_operation(const AudioCommand &command) {
    OperationResult result{};
    const auto operation = command.operation;
    const auto cue = command.cue;
    const auto generation = command.generation;
    const auto embedded = operation == AudioOperation::playback
                              ? embedded_sound(cue)
                              : EmbeddedSoundView{};
    const auto pcm = parse_embedded_wav(embedded);
    if (embedded.data != nullptr && pcm.data == nullptr) {
        ESP_LOGW(kTag, "Embedded sound %u invalid; using generated fallback",
                 static_cast<unsigned>(cue));
    }
    result.expected_bytes = operation == AudioOperation::capture
                                ? kDiagnosticBytes
                                : operation == AudioOperation::voice_capture
                                      ? 0
                                : pcm.data != nullptr
                                      ? pcm.size
                                      : sound_cue_transfer_bytes(cue);
    AudioResources resources{};
    esp_pm_lock_handle_t pm_lock{nullptr};
    std::uint8_t *buffer{nullptr};
    AudioSettings audio_settings{};
    portENTER_CRITICAL(&state_mux);
    audio_settings = state.settings;
    portEXIT_CRITICAL(&state_mux);

    if (!force_amplifier_off()) {
        result.status = {nightglass::core::StatusCode::io_error, "audio PA low could not be verified"};
        result.amplifier_disabled = false;
        result.resources_released = true;
        return result;
    }
    // The I2S driver copies between this application buffer and its own DMA
    // ring. Keep samples in PSRAM so AMOLED, BLE, and DMA descriptors retain
    // scarce contiguous internal memory.
    buffer = static_cast<std::uint8_t *>(
        heap_caps_malloc(kDiagnosticBytes, MALLOC_CAP_SPIRAM | MALLOC_CAP_8BIT));
    if (buffer == nullptr) {
        result.status = {nightglass::core::StatusCode::no_memory,
                         "audio DMA buffer unavailable"};
        return result;
    }
    if (!acquire_audio_power_lock(pm_lock)) {
        heap_caps_free(buffer);
        result.status = {nightglass::core::StatusCode::unavailable,
                         "audio power lock unavailable"};
        return result;
    }

    bool opened = false;
    if (operation == AudioOperation::playback) {
        opened = open_output(resources, audio_settings.volume_percent);
        if (opened) {
            mark_operation_active(operation, cue, false, true, true,
                                  audio_settings.volume_percent);
            // Prove the enabled I2S path accepts data while the physical PA is
            // still low. esp_codec_dev_open() does not propagate every data-if
            // error from the vendor wrapper.
            std::fill_n(buffer, kFrameBytes, 0U);
            std::size_t probe_written{};
            const auto probe_status = i2s_channel_write(resources.channel, buffer,
                                                         kFrameBytes, &probe_written,
                                                         kIoTimeoutMs);
            if (probe_status != ESP_OK || probe_written != kFrameBytes) {
                result.status = {probe_status == ESP_ERR_TIMEOUT
                                     ? nightglass::core::StatusCode::timeout
                                     : nightglass::core::StatusCode::io_error,
                                 "speaker path readiness probe failed"};
            } else if (!set_amplifier(true)) {
                result.status = {nightglass::core::StatusCode::io_error,
                                 "audio PA enable failed"};
            } else {
                portENTER_CRITICAL(&state_mux);
                state.amplifier_disabled = false;
                state.amplifier_disabled_verified = false;
                ++state.sequence;
                portEXIT_CRITICAL(&state_mux);
                bool transfer_ok = true;
                std::size_t frame_offset{};
                const auto cue_frames = result.expected_bytes / kFrameBytes;
                while (frame_offset < cue_frames) {
                    if (cue_cancelled(cue, generation)) {
                        // Cancellation is a successful bounded stop, not a
                        // hardware failure. Account only for bytes requested
                        // before the generation changed.
                        result.expected_bytes = result.transferred_bytes;
                        result.status = nightglass::core::Status::Ok();
                        transfer_ok = false;
                        break;
                    }
                    const auto frames_this_chunk =
                        std::min(kDiagnosticFrames, cue_frames - frame_offset);
                    const auto bytes_this_chunk = frames_this_chunk * kFrameBytes;
                    if (pcm.data != nullptr) {
                        std::memcpy(buffer, pcm.data + frame_offset * kFrameBytes,
                                    bytes_this_chunk);
                    } else {
                        generate_sound_cue(reinterpret_cast<std::int16_t *>(buffer), cue,
                                           frame_offset, frames_this_chunk);
                    }
                    std::size_t written{};
                    const auto io_status = i2s_channel_write(
                        resources.channel, buffer, bytes_this_chunk, &written, kIoTimeoutMs);
                    result.transferred_bytes += written;
                    if (io_status != ESP_OK || written != bytes_this_chunk) {
                        result.status = {io_status == ESP_ERR_TIMEOUT
                                             ? nightglass::core::StatusCode::timeout
                                             : nightglass::core::StatusCode::io_error,
                                         "speaker transfer incomplete"};
                        transfer_ok = false;
                        break;
                    }
                    frame_offset += frames_this_chunk;
                }
                if (transfer_ok && result.transferred_bytes == result.expected_bytes) {
                    // A successful write means the bytes reached the DMA ring,
                    // not that the final sample has left the I2S peripheral.
                    // Keep the PM lock and physical PA gate active until the
                    // final streamed chunk has left the I2S peripheral.
                    vTaskDelay(pdMS_TO_TICKS(kPlaybackDrainMs));
                    result.status = nightglass::core::Status::Ok();
                }
            }
        }
    } else {
        opened = open_input(resources);
        if (opened) {
            mark_operation_active(operation, cue, true, false, true, 0);
            // Let the ES7210 bias/HPF settle and allow its two-buffer DMA ring
            // to overwrite startup zeros before measuring the live capsules.
            vTaskDelay(pdMS_TO_TICKS(kMicrophoneSettleMs));
            if (operation == AudioOperation::voice_capture) {
                if (command.voice_sink == nullptr || command.voice_capacity == 0 ||
                    command.voice_capacity > kVoiceMaximumEncodedBytes ||
                    command.voice_callback == nullptr) {
                    result.status = {nightglass::core::StatusCode::invalid_state,
                                     "voice capture target invalid"};
                } else {
                    bool transfer_ok = true;
                    std::array<std::uint8_t, kDiagnosticBytes / 4U> encoded_chunk{};
                    while (result.encoded_bytes < command.voice_capacity &&
                           !voice_stop_requested.load(std::memory_order_acquire)) {
                        std::size_t read{};
                        const auto io_status = i2s_channel_read(
                            resources.channel, buffer, kDiagnosticBytes, &read,
                            kIoTimeoutMs);
                        if (io_status != ESP_OK || read != kDiagnosticBytes) {
                            result.status = {
                                io_status == ESP_ERR_TIMEOUT
                                    ? nightglass::core::StatusCode::timeout
                                    : nightglass::core::StatusCode::io_error,
                                "voice microphone transfer incomplete"};
                            transfer_ok = false;
                            break;
                        }
                        const auto samples = std::span<const std::int16_t>(
                            reinterpret_cast<const std::int16_t *>(buffer),
                            read / sizeof(std::int16_t));
                        const auto available = std::min<std::size_t>(
                            encoded_chunk.size(),
                            command.voice_capacity - result.encoded_bytes);
                        const auto encoded = encode_voice_mulaw_8khz(
                            samples, {encoded_chunk.data(), available});
                        if (encoded != samples.size() / 2U ||
                            !command.voice_sink(command.voice_context,
                                                {encoded_chunk.data(), encoded})) {
                            result.status = {nightglass::core::StatusCode::no_memory,
                                             "voice page store exhausted"};
                            transfer_ok = false;
                            break;
                        }
                        result.capture_rms = std::max(result.capture_rms,
                                                      pcm16_rms(samples.data(), samples.size()));
                        result.transferred_bytes += read;
                        result.encoded_bytes += encoded;
                    }
                    result.cancelled = voice_cancel_requested.load(std::memory_order_acquire);
                    if (result.cancelled) {
                        result.encoded_bytes = 0;
                        result.status = {nightglass::core::StatusCode::invalid_state,
                                         "voice capture cancelled"};
                    } else if (transfer_ok && result.encoded_bytes > 0) {
                        result.status = nightglass::core::Status::Ok();
                    } else if (transfer_ok) {
                        result.status = {nightglass::core::StatusCode::invalid_state,
                                         "voice capture empty"};
                    }
                    // A user-ended recording is complete, not a short transfer.
                    result.expected_bytes = result.transferred_bytes;
                }
            } else {
                std::size_t read{};
                const auto io_status = i2s_channel_read(resources.channel, buffer,
                                                        kDiagnosticBytes, &read,
                                                        kIoTimeoutMs);
                result.transferred_bytes = read;
                if (io_status == ESP_OK && read == kDiagnosticBytes) {
                    result.capture_rms = pcm16_rms(
                        reinterpret_cast<const std::int16_t *>(buffer),
                        read / sizeof(std::int16_t));
#if CONFIG_NIGHTGLASS_AUDIO_BOOT_SELF_TEST
                    const auto *samples = reinterpret_cast<const std::int16_t *>(buffer);
                    std::int16_t minimum = samples[0];
                    std::int16_t maximum = samples[0];
                    std::size_t nonzero{};
                    for (std::size_t index = 0; index < read / sizeof(std::int16_t); ++index) {
                        minimum = std::min(minimum, samples[index]);
                        maximum = std::max(maximum, samples[index]);
                        if (samples[index] != 0) ++nonzero;
                    }
                    ESP_LOGI(kTag, "capture raw min=%d max=%d nonzero=%u/%u",
                             minimum, maximum, static_cast<unsigned>(nonzero),
                             static_cast<unsigned>(read / sizeof(std::int16_t)));
#endif
                    result.status = nightglass::core::Status::Ok();
                } else {
                    result.status = {io_status == ESP_ERR_TIMEOUT
                                         ? nightglass::core::StatusCode::timeout
                                         : nightglass::core::StatusCode::io_error,
                                     "microphone transfer incomplete"};
                }
            }
        }
    }

    if (!opened && result.status.is_ok()) {
        result.status = {nightglass::core::StatusCode::io_error,
                         operation == AudioOperation::playback
                             ? "ES8311 output initialization failed"
                             : "ES7210 input initialization failed"};
    }

    const auto cleanup = release_resources(resources);
    std::memset(buffer, 0, kDiagnosticBytes);
    heap_caps_free(buffer);
    const bool power_lock_released = release_audio_power_lock(pm_lock);
    if (!power_lock_released) ESP_LOGE(kTag, "audio PM lock cleanup failed");
    result.amplifier_disabled = cleanup.amplifier_disabled;
    result.resources_released = cleanup.resources_released && power_lock_released;
    if (!cleanup.amplifier_disabled) {
        result.status = {nightglass::core::StatusCode::io_error,
                         "audio PA low could not be verified after test"};
    } else if (!result.resources_released) {
        result.status = {nightglass::core::StatusCode::io_error,
                         "audio cleanup incomplete; restart required"};
    }
    return result;
}

void finish_operation(AudioOperation operation, const OperationResult &result) {
    portENTER_CRITICAL(&state_mux);
    state.hardware_initialized = true;
    state.hardware_active = false;
    state.input_ready = false;
    state.output_ready = false;
    state.operation = operation;
    state.last_operation_ok = result.status.is_ok();
    state.last_operation_status = static_cast<std::uint8_t>(result.status.code);
    state.last_transfer_bytes = static_cast<std::uint32_t>(result.transferred_bytes);
    state.last_io_us = esp_timer_get_time();
    state.amplifier_disabled = result.amplifier_disabled;
    state.amplifier_disabled_verified = result.amplifier_disabled;
    if (operation == AudioOperation::capture ||
        operation == AudioOperation::voice_capture) {
        state.frames_captured += static_cast<std::uint32_t>(result.transferred_bytes / kFrameBytes);
        state.last_capture_rms = result.capture_rms;
        if (!result.status.is_ok()) ++state.read_errors;
    } else {
        state.frames_played += static_cast<std::uint32_t>(result.transferred_bytes / kFrameBytes);
        if (!result.status.is_ok()) ++state.write_errors;
    }
    if (result.transferred_bytes < result.expected_bytes) {
        state.dropped_bytes +=
            static_cast<std::uint32_t>(result.expected_bytes - result.transferred_bytes);
    }
    // A failed transfer can be retried. A missing PA-low proof or a failed
    // channel release cannot, because resource ownership is no longer known.
    state.hardware_failed = state.hardware_failed || !result.amplifier_disabled ||
                            !result.resources_released;
    ++state.sequence;
    portEXIT_CRITICAL(&state_mux);

