jason-allen-oneal/ESP32-S3-Watch-OS/components/nightglass_services/src/audio.cpp
    if (!result.amplifier_disabled) {
        nightglass::core::health_registry().set(
            "audio", nightglass::core::HealthState::failed,
            "PA low unverified; audio diagnostics locked");
    } else if (!result.resources_released) {
        nightglass::core::health_registry().set(
            "audio", nightglass::core::HealthState::failed,
            "audio resource cleanup incomplete; restart required");
    } else if (result.status.is_ok()) {
        nightglass::core::health_registry().set(
            "audio", nightglass::core::HealthState::ok,
            "bounded test complete; PA logic-low verified");
    } else {
        nightglass::core::health_registry().set(
            "audio", nightglass::core::HealthState::degraded,
            "diagnostic transfer failed; PA logic-low verified");
    }
}

void audio_worker_task(void *) {
    while (true) {
        AudioCommand command{};
        if (xQueueReceive(audio_queue, &command, portMAX_DELAY) != pdTRUE) continue;
        portENTER_CRITICAL(&state_mux);
        const bool locked = state.hardware_failed;
        auto effective_settings = state.settings;
        effective_settings.do_not_disturb = effective_settings.do_not_disturb ||
                                             state.scheduled_dnd;
        const bool allowed = command.operation != AudioOperation::playback ||
                             audio_cue_allowed(command.cue, effective_settings);
        if (locked) {
            state.operation = command.operation;
            state.cue = command.cue;
            state.last_operation_ok = false;
            state.last_operation_status = static_cast<std::uint8_t>(
                nightglass::core::StatusCode::unavailable);
            ++state.sequence;
        }
        portEXIT_CRITICAL(&state_mux);
        const bool stale = command.generation != 0 &&
                           cue_cancelled(command.cue, command.generation);
        OperationResult result{};
        bool ran = false;
        if (!locked && allowed && !stale) {
            result = run_operation(command);
            ran = true;
            finish_operation(command.operation, result);
        }
        if (command.operation == AudioOperation::voice_capture &&
            command.voice_callback != nullptr) {
            if (!ran) {
                result.status = {nightglass::core::StatusCode::unavailable,
                                 "voice capture unavailable"};
            }
            const VoiceCaptureResult completion{
                result.status.code, result.encoded_bytes,
                result.capture_rms, result.cancelled};
            command.voice_callback(command.voice_context, completion);
        }
        portENTER_CRITICAL(&state_mux);
        const bool safety_locked = state.hardware_failed;
        portEXIT_CRITICAL(&state_mux);
        if (safety_locked) {
            // Once PA-low or resource ownership is uncertain, no queued
            // command may attempt another codec/I2S session. New requests are
            // rejected by request(); reset the existing fixed queue and its
            // mirrors immediately rather than walking stale commands.
            (void)xQueueReset(audio_queue);
            portENTER_CRITICAL(&state_mux);
            pending_cues = 0;
            pending_count = 0;
            capture_pending = false;
            state.operation_pending = false;
            ++state.sequence;
            portEXIT_CRITICAL(&state_mux);
            continue;
        }
        portENTER_CRITICAL(&state_mux);
        if (command.operation == AudioOperation::capture ||
            command.operation == AudioOperation::voice_capture) {
            capture_pending = false;
        } else {
            if (command.generation == 0 ||
                command.generation == cue_generation_locked(command.cue)) {
                pending_cues &= static_cast<std::uint16_t>(
                    ~(1U << static_cast<unsigned>(command.cue)));
            }
        }
        if (pending_count > 0) --pending_count;
        state.operation_pending = pending_count > 0;
        ++state.sequence;
        portEXIT_CRITICAL(&state_mux);
    }
}

nightglass::core::Status request(AudioOperation operation, SoundCue cue,
                                 nightglass::core::WakeReason wake_reason,
                                 std::size_t voice_capacity = 0,
                                 VoiceCaptureSink voice_sink = nullptr,
                                 VoiceCaptureCallback voice_callback = nullptr,
                                 void *voice_context = nullptr) {
    if (audio_bus == nullptr || audio_queue == nullptr || audio_worker == nullptr ||
        request_mutex == nullptr) {
        return {nightglass::core::StatusCode::unavailable, "audio service is not armed"};
    }
    if (xSemaphoreTake(request_mutex, pdMS_TO_TICKS(10)) != pdTRUE) {
        return {nightglass::core::StatusCode::unavailable,
                "audio request path is busy"};
    }
    const auto cue_bit = static_cast<std::uint16_t>(
        1U << static_cast<unsigned>(cue));
    const bool critical = operation == AudioOperation::playback &&
                          (cue == SoundCue::alarm || cue == SoundCue::timer);
    portENTER_CRITICAL(&state_mux);
    const bool locked = state.hardware_failed;
    const bool capture_operation = operation == AudioOperation::capture ||
                                   operation == AudioOperation::voice_capture;
    const bool duplicate = capture_operation
                               ? capture_pending
                               : (pending_cues & cue_bit) != 0;
    const bool voice_busy = operation == AudioOperation::voice_capture &&
                            pending_count != 0;
    const bool reserved_capacity = !critical &&
                                   pending_count >=
                                       kAudioQueueDepth - kCriticalCueReserve;
    portEXIT_CRITICAL(&state_mux);
    if (locked) {
        xSemaphoreGive(request_mutex);
        return {nightglass::core::StatusCode::unavailable,
                "audio diagnostics locked after a safety failure"};
    }
    if (duplicate || voice_busy) {
        xSemaphoreGive(request_mutex);
        return operation == AudioOperation::voice_capture
                   ? nightglass::core::Status{
                         nightglass::core::StatusCode::unavailable,
                         "audio path is busy"}
                   : nightglass::core::Status::Ok();
    }
    if (reserved_capacity) {
        portENTER_CRITICAL(&state_mux);
        state.last_operation_status = static_cast<std::uint8_t>(
            nightglass::core::StatusCode::no_memory);
        ++state.sequence;
        portEXIT_CRITICAL(&state_mux);
        xSemaphoreGive(request_mutex);
        return {nightglass::core::StatusCode::no_memory,
                "audio cue queue reserved for alarm/timer"};
    }

