jason-allen-oneal/ESP32-S3-Watch-OS/components/nightglass_services/src/audio.cpp
    // Resets the user-idle deadline, preventing PowerService's explicit
    // light-sleep path from racing a short diagnostic. The PM lock in the
    // task covers automatic light sleep while hardware is open.
    power_service().note_activity(wake_reason);
    std::uint32_t generation = 0;
    portENTER_CRITICAL(&state_mux);
    generation = cue_generation_locked(cue);
    portEXIT_CRITICAL(&state_mux);
    const AudioCommand command{operation, cue, generation, voice_capacity,
                               voice_sink, voice_callback, voice_context};
    const bool urgent = critical || cue == SoundCue::call;
    const auto queued = urgent ? xQueueSendToFront(audio_queue, &command, 0)
                               : xQueueSendToBack(audio_queue, &command, 0);
    if (queued != pdTRUE) {
        portENTER_CRITICAL(&state_mux);
        state.last_operation_status = static_cast<std::uint8_t>(
            nightglass::core::StatusCode::no_memory);
        ++state.sequence;
        portEXIT_CRITICAL(&state_mux);
        xSemaphoreGive(request_mutex);
        return {nightglass::core::StatusCode::no_memory, "audio cue queue full"};
    }
    // Publish duplicate-suppression state only after the command is actually
    // present in the queue. The request mutex prevents a concurrent caller
    // from observing a reservation that a failed send later rolls back.
    portENTER_CRITICAL(&state_mux);
    if (capture_operation) capture_pending = true;
    else pending_cues |= cue_bit;
    ++pending_count;
    state.operation_pending = true;
    state.operation = operation;
    state.cue = cue;
    state.last_operation_ok = false;
    ++state.sequence;
    portEXIT_CRITICAL(&state_mux);
    xSemaphoreGive(request_mutex);
    return nightglass::core::Status::Ok();
}
#else
AudioService instance;
AudioSnapshot state{};
#endif

}  // namespace

std::size_t bounded_audio_bytes(std::size_t requested) noexcept {
    constexpr std::size_t kMonoFrameBytes = sizeof(std::int16_t);
    return std::min(requested, kMaxIoBytes) & ~(kMonoFrameBytes - 1U);
}

std::uint32_t pcm16_rms(const std::int16_t *samples, std::size_t count) noexcept {
    if (samples == nullptr || count == 0) return 0;
    long double sum = 0.0L;
    for (std::size_t i = 0; i < count; ++i) {
        const long double value = samples[i];
        sum += value * value;
    }
    const auto rms = std::sqrt(sum / static_cast<long double>(count));
    return rms >= std::numeric_limits<std::uint32_t>::max()
               ? std::numeric_limits<std::uint32_t>::max()
               : static_cast<std::uint32_t>(rms);
}

nightglass::core::Status AudioService::start(i2c_master_bus_handle_t bus_handle) {
#if !NIGHTGLASS_AUDIO_RUNTIME
    (void)bus_handle;
    state = {};
    return {nightglass::core::StatusCode::unavailable, "audio disabled by build configuration"};
#else
    const auto persisted_settings = load_audio_settings();
    state = {};
    state.settings = persisted_settings;
    state.enabled = true;
    state.amplifier_disabled = force_amplifier_off();
    state.amplifier_disabled_verified = state.amplifier_disabled;
    if (bus_handle == nullptr) {
        state.hardware_failed = true;
        nightglass::core::health_registry().set("audio", nightglass::core::HealthState::failed,
                                                 "I2C bus unavailable; audio not armed");
        return {nightglass::core::StatusCode::unavailable, "audio I2C bus unavailable"};
    }
    if (!state.amplifier_disabled) {
        state.hardware_failed = true;
        nightglass::core::health_registry().set("audio", nightglass::core::HealthState::failed,
                                                 "PA low could not be verified at boot");
        return {nightglass::core::StatusCode::io_error, "audio PA fail-safe unavailable"};
    }
    pending_cues = 0;
    pending_count = 0;
    capture_pending = false;
    voice_stop_requested.store(false, std::memory_order_release);
    voice_cancel_requested.store(false, std::memory_order_release);
    alarm_generation = 1;
    timer_generation = 1;
    request_mutex = xSemaphoreCreateMutexStatic(&request_mutex_state);
    audio_queue = xQueueCreateStatic(kAudioQueueDepth, sizeof(AudioCommand),
                                     audio_queue_storage.data(), &audio_queue_state);
    if (request_mutex == nullptr || audio_queue == nullptr ||
        xTaskCreateWithCaps(audio_worker_task, "ng_audio", kAudioTaskStackBytes,
                            nullptr, 3, &audio_worker,
                            MALLOC_CAP_SPIRAM | MALLOC_CAP_8BIT) != pdPASS) {
        audio_queue = nullptr;
        audio_worker = nullptr;
        state.hardware_failed = true;
        nightglass::core::health_registry().set(
            "audio", nightglass::core::HealthState::failed,
            "audio command worker unavailable");
        return {nightglass::core::StatusCode::no_memory, "audio command worker unavailable"};
    }
    audio_bus = bus_handle;
    nightglass::core::health_registry().set(
        "audio", nightglass::core::HealthState::degraded,
        "armed diagnostic only; codec/I2S/PA stay off until explicit test");
    ESP_LOGI(kTag, "Audio armed; PA logic-low verified; hardware deferred");
    return nightglass::core::Status::Ok();
#endif
}

nightglass::core::Status AudioService::request_microphone_sample() {
#if !NIGHTGLASS_AUDIO_RUNTIME
    return {nightglass::core::StatusCode::unavailable, "audio disabled by build configuration"};
#else
    return request(AudioOperation::capture, SoundCue::test,
                   nightglass::core::WakeReason::touch);
#endif
}

nightglass::core::Status AudioService::request_voice_capture(
    std::size_t maximum_encoded_bytes, VoiceCaptureSink sink,
    VoiceCaptureCallback callback, void *context) {
#if !NIGHTGLASS_AUDIO_RUNTIME
    (void)maximum_encoded_bytes;
    (void)sink;
    (void)callback;
    (void)context;
    return {nightglass::core::StatusCode::unavailable,
            "audio disabled by build configuration"};
#else
    if (maximum_encoded_bytes == 0 ||
        maximum_encoded_bytes > kVoiceMaximumEncodedBytes ||
        sink == nullptr || callback == nullptr) {
        return {nightglass::core::StatusCode::invalid_state,
                "invalid voice capture target"};
    }
    voice_stop_requested.store(false, std::memory_order_release);
    voice_cancel_requested.store(false, std::memory_order_release);
    return request(AudioOperation::voice_capture, SoundCue::test,
                   nightglass::core::WakeReason::touch,
                   maximum_encoded_bytes, sink, callback, context);
#endif
}

void AudioService::stop_voice_capture(bool cancel) {
#if NIGHTGLASS_AUDIO_RUNTIME
    if (cancel) voice_cancel_requested.store(true, std::memory_order_release);
    voice_stop_requested.store(true, std::memory_order_release);
#else
    (void)cancel;
#endif
}

