jason-allen-oneal/ESP32-S3-Watch-OS/components/nightglass_services/src/audio.cpp
nightglass::core::Status AudioService::request_test_tone() {
#if !NIGHTGLASS_AUDIO_RUNTIME
    return {nightglass::core::StatusCode::unavailable, "audio disabled by build configuration"};
#else
    return request_sound(SoundCue::test);
#endif
}

nightglass::core::Status AudioService::request_sound(SoundCue cue) {
#if !NIGHTGLASS_AUDIO_RUNTIME
    (void)cue;
    return {nightglass::core::StatusCode::unavailable, "audio disabled by build configuration"};
#else
    if (cue == SoundCue::alarm || cue == SoundCue::timer || cue == SoundCue::call) {
        stop_voice_capture(true);
    }
    AudioSettings settings{};
    portENTER_CRITICAL(&state_mux);
    settings = state.settings;
    settings.do_not_disturb = settings.do_not_disturb || state.scheduled_dnd;
    portEXIT_CRITICAL(&state_mux);
    if (!audio_cue_allowed(cue, settings)) {
        return nightglass::core::Status::Ok();
    }
    auto wake_reason = nightglass::core::WakeReason::notification;
    if (cue == SoundCue::alarm) wake_reason = nightglass::core::WakeReason::alarm;
    else if (cue == SoundCue::timer) wake_reason = nightglass::core::WakeReason::timer;
    else if (cue == SoundCue::test || cue == SoundCue::success || cue == SoundCue::warning) {
        wake_reason = nightglass::core::WakeReason::touch;
    }
    return request(AudioOperation::playback, cue, wake_reason);
#endif
}

void AudioService::cancel_sound(SoundCue cue) {
#if NIGHTGLASS_AUDIO_RUNTIME
    if (cue != SoundCue::alarm && cue != SoundCue::timer) return;
    portENTER_CRITICAL(&state_mux);
    auto &generation = cue == SoundCue::alarm ? alarm_generation : timer_generation;
    if (++generation == 0) generation = 1;
    pending_cues &= static_cast<std::uint16_t>(
        ~(1U << static_cast<unsigned>(cue)));
    ++state.sequence;
    portEXIT_CRITICAL(&state_mux);
#else
    (void)cue;
#endif
}

void AudioService::set_scheduled_dnd(bool active) {
#if NIGHTGLASS_AUDIO_RUNTIME
    portENTER_CRITICAL(&state_mux);
    if (state.scheduled_dnd != active) {
        state.scheduled_dnd = active;
        ++state.sequence;
    }
    portEXIT_CRITICAL(&state_mux);
#else
    (void)active;
#endif
}

nightglass::core::Status AudioService::update_settings(const AudioSettings &settings) {
#if !NIGHTGLASS_AUDIO_RUNTIME
    (void)settings;
    return {nightglass::core::StatusCode::unavailable,
            "audio disabled by build configuration"};
#else
    if (!valid_audio_settings(settings)) {
        return {nightglass::core::StatusCode::invalid_state, "invalid audio settings"};
    }
    const auto persisted = save_audio_settings(settings);
    if (persisted != ESP_OK) {
        return {nightglass::core::StatusCode::io_error,
                "audio settings persistence failed"};
    }
    portENTER_CRITICAL(&state_mux);
    state.settings = settings;
    ++state.sequence;
    portEXIT_CRITICAL(&state_mux);
    return nightglass::core::Status::Ok();
#endif
}

AudioSnapshot AudioService::snapshot() const {
#if NIGHTGLASS_AUDIO_RUNTIME
    AudioSnapshot copy{};
    portENTER_CRITICAL(&state_mux);
    copy = state;
    portEXIT_CRITICAL(&state_mux);
    return copy;
#else
    return state;
#endif
}

AudioService &audio_service() { return instance; }

}  // namespace nightglass::services
